In [2]:
# importing the required libraries
import os
import pandas as pd
import matplotlib.pyplot as plt

os.chdir( os.path.join("..","..","..") )

from Code.src.modules.db_ops import *

In [3]:
#connecting to a sql database
# configuring the sql connection and query execution
db_enrollment = ConnectDB( os.path.join("Data", "02_processed", "enrollment4EDA.db") )

In [4]:
# example test query
db_enrollment.runQuery("""
    SELECT rec_id, stu_id
    FROM enrollment4EDA
    LIMIT 5;
""")

   rec_id   stu_id
0       0  CEC3286
1       1  CEC3289
2       2   CEC865
3       3   CEC865
4       4   CEC901

## Admitted new student per semester in MS Data Analytics Engineering

In [5]:
db_enrollment.runQuery("""
    SELECT stu_admit_term_year, stu_admit_term_name, COUNT(DISTINCT stu_id) AS stu_count
    FROM enrollment4EDA
    WHERE
        stu_admit_term_year >= 2017
        AND stu_prog_desc = 'MS Data Analytics Engineering'
    GROUP BY stu_admit_term_year, stu_admit_term_name;
""")

    stu_admit_term_year stu_admit_term_name  stu_count
0                  2017                Fall        119
1                  2017              Spring         45
2                  2018                Fall        143
3                  2018              Spring        102
4                  2019                Fall        173
5                  2019              Spring        124
6                  2019              Summer          9
7                  2020                Fall        171
8                  2020              Spring        113
9                  2020              Summer         12
10                 2021                Fall        236
11                 2021              Spring        131
12                 2021              Summer          6
13                 2022                Fall        246
14                 2022              Spring        165
15                 2022              Summer         10
16                 2023              Spring        170

In [15]:
db_enrollment.runQuery("""
    SELECT reg_term_code, reg_term_desc, stu_id,stu_visa, crs, MAX(reg_status_date) as final_reg_date, reg_status
    FROM enrollment4EDA
    WHERE 
        reg_term_desc = 'Fall 2021'
        AND stu_visa = 'F1 Visa'
        AND crs = 'AIT 580'
    GROUP BY reg_term_code, reg_term_desc, stu_id, crs
    ORDER BY final_reg_date;
""")

,reg_term_code,reg_term_desc,stu_id,stu_visa,crs,final_reg_date,reg_status
0,202170,Fall 2021,CEC19858,F1 Visa,AIT 580,2021-04-20 00:00:00,**Web Registered**
1,202170,Fall 2021,CEC20058,F1 Visa,AIT 580,2021-04-20 00:00:00,**Web Registered**
2,202170,Fall 2021,CEC22781,F1 Visa,AIT 580,2021-04-20 00:00:00,**Web Registered**
3,202170,Fall 2021,CEC22858,F1 Visa,AIT 580,2021-04-20 00:00:00,**Web Registered**
4,202170,Fall 2021,CEC22942,F1 Visa,AIT 580,2021-04-20 00:00:00,**Web Registered**
...,...,...,...,...,...,...,...
136,202170,Fall 2021,CEC27093,F1 Visa,AIT 580,2021-08-28 00:00:00,**Web Registered**
137,202170,Fall 2021,CEC26155,F1 Visa,AIT 580,2021-08-29 00:00:00,**Web Registered**
138,202170,Fall 2021,CEC27131,F1 Visa,AIT 580,2021-08-29 00:00:00,**Web Registered**
139,202170,Fall 2021,CEC27486,F1 Visa,AIT 580,2021-08-30 00:00:00,**Web Registered**
140,202170,Fall 2021,CEC27725,F1 Visa,AIT 580,2021-09-14 00:00:00,**Registered**